src_ext/InformationRegisters/УЗ_Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Оповещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_СписаниеОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ГрафикРабочегоВремениПедагога</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачислениеБонусов</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Оповещения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//Время события — момент создания на сервере (ТекущаяДатаСеанса, как в УЗ_Сервер.ЗначенияНапоминания), а не часы
//компьютера пользователя. Кому и «Завершено» у чужих и общих оповещений меняет только руководитель (у остальных
//поля только для просмотра; запись чужого всё равно не пропустит модуль набора записей регистра).
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Запись.ВремяСобытия) Тогда
		Запись.ВремяСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_Настройки) Тогда
		Возврат;
	КонецЕсли;
	Текущий = УЗ_Среда.ТекущийПользователь();
	Если Не ЗначениеЗаполнено(Запись.Пользователь) И Не ЗначениеЗаполнено(Запись.Источник) Тогда
		Запись.Пользователь = Текущий;		//новое напоминание — себе
	КонецЕсли;
	Элементы.Пользователь.ТолькоПросмотр = Истина;
	Если Запись.Пользователь <> Текущий Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры
